Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum
Defines the subsection types.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.UNKNOWN_TYPE
The subsection subtype is unknown.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.I
The profile type I.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.UNSYMMETRICAL_I
The profile type unsymmetrical I.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.L
The profile type L.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.Z
The profile type Z.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.U
The profile type U.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.PL
The profile type PL.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.D
The profile type D.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.PD
The profile type PD.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.P
The profile type P.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.C
The profile type C.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.T
The profile type T.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.T_MIRRORED
The profile type T mirrored.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.USER_DEFINED
The profile type user defined.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.TWIN_L_1
The profile type twin L 1.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.TWIN_L_2
The profile type twin L 2.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.TWIN_U_1
The profile type twin U 1.

Tekla.Structures.Analysis.AnalysisSubSection.AnalysisSubSectionTypeEnum.TWIN_U_2
The profile type twin U 2.